scriptiot/evm/drivers/zephyr/display/stm32_hal/display_ili9341.h
#ifndef ZEPHYR_DRIVERS_DISPLAY_DISPLAY_ILI9341_H_
#define ZEPHYR_DRIVERS_DISPLAY_DISPLAY_ILI9341_H_

#include "stm32f1xx.h"

#define      ILI9341_FSMC_Addr_CMD         ( ( uint32_t ) 0x6C000000 )     
#define      ILI9341_FSMC_Addr_DATA        ( ( uint32_t ) 0x6D000000 )


#define ILI9341_CMD_SOFTWARE_RESET 0x01
#define ILI9341_CMD_ENTER_SLEEP 0x10
#define ILI9341_CMD_EXIT_SLEEP 0x11
#define ILI9341_CMD_GAMMA_SET 0x26
#define ILI9341_CMD_DISPLAY_OFF 0x28
#define ILI9341_CMD_DISPLAY_ON 0x29
#define ILI9341_CMD_COLUMN_ADDR 0x2a
#define ILI9341_CMD_PAGE_ADDR 0x2b
#define ILI9341_CMD_MEM_WRITE 0x2c
#define ILI9341_CMD_MEM_ACCESS_CTRL 0x36
#define ILI9341_CMD_PIXEL_FORMAT_SET 0x3A
#define ILI9341_CMD_FRAME_CTRL_NORMAL_MODE 0xB1
#define ILI9341_CMD_DISPLAY_FUNCTION_CTRL 0xB6
#define ILI9341_CMD_POWER_CTRL_1 0xC0
#define ILI9341_CMD_POWER_CTRL_2 0xC1
#define ILI9341_CMD_VCOM_CTRL_1 0xC5
#define ILI9341_CMD_VCOM_CTRL_2 0xC7
#define ILI9341_CMD_POSITIVE_GAMMA_CORRECTION 0xE0
#define ILI9341_CMD_NEGATIVE_GAMMA_CORRECTION 0xE1

#define ILI9341_CMD_POWER_CTRL_A 0xCB
#define ILI9341_CMD_POWER_CTRL_B 0xCF
#define ILI9341_CMD_DRVR_TIMING_CTRL_A_I 0xE8
#define ILI9341_CMD_DRVR_TIMING_CTRL_A_E 0xE9
#define ILI9341_CMD_DRVR_TIMING_CTRL_B 0xEA
#define ILI9341_CMD_POWER_ON_SEQ_CTRL 0xED
#define ILI9341_CMD_ENABLE_3G 0xF2
#define ILI9341_CMD_PUMP_RATIO_CTRL 0xF7

#define ILI9341_DATA_MEM_ACCESS_CTRL_MY 0x80
#define ILI9341_DATA_MEM_ACCESS_CTRL_MX 0x40
#define ILI9341_DATA_MEM_ACCESS_CTRL_MV 0x20
#define ILI9341_DATA_MEM_ACCESS_CTRL_ML 0x10
#define ILI9341_DATA_MEM_ACCESS_CTRL_BGR 0x08
#define ILI9341_DATA_MEM_ACCESS_CTRL_MH 0x04

#define ILI9341_DATA_PIXEL_FORMAT_RGB_18_BIT 0x60
#define ILI9341_DATA_PIXEL_FORMAT_RGB_16_BIT 0x50
#define ILI9341_DATA_PIXEL_FORMAT_MCU_18_BIT 0x06
#define ILI9341_DATA_PIXEL_FORMAT_MCU_16_BIT 0x05


#define	digitalH(p,i)			{p->BSRR=i;}					
#define digitalL(p,i)			{p->BSRR=(uint32_t)i << 16;}

#endif /* ZEPHYR_DRIVERS_DISPLAY_DISPLAY_ILI9341_H_ */

